// © Copyright 2015-2016 HP Development Company, L.P.

XMONoZIPCodeError = "ZIP code cannot be empty.";
XMO5DigitZIPCodeFormatError = "ZIP code must be a five-digit number.";
XMO6DigitZIPCodeFormatError = "ZIP code must be a six-digit number.";
XMONoCanadaZIPCodeError = "Postal code cannot be empty.";
XMOCanadaZIPCodeFormatError = "Postal code must be in the \"A9A 9A9\" format.";
XMONoUnitedKindomZIPCodeError = "Postcode cannot be empty.";
XMOUnitedKindomZIPCodeFormatError = "Postcode must be \"AI-2640\" or in the \"AX[XX] 9AA\" format";
XMOUnitedKindomBFPOZIPCodeFormatError = "Postcode must be in the \"BFPO [c/o] N[NNN]\" format";
XMOUnitedStatesZIPCodeFormatError = "ZIP code must be in the \"99999[-9999]\" format.";
XMOFranceZIPCodeFormatError = "ZIP code must be in the \"[F-]9X999\" format.";
